# Data cleansing

During the course of doing data analysis and modeling, a significant amount of time is spent on data preparation:

*   loading
*   cleaning
*   transforming
*   rearraging

Such tasks are often reported to take up 80% or more of an analystâ€™s time.

What can happen with the loading data are
* missing data
* duplicate data
* string manipulation
* other analytical data transformation

## Missing data
---

Some data are imperfect, but it is functional for lot of users

For numeric data,
  Pandas use Nan ``` Nan``` (Not a Number) to represent the number

So call a *sentinel value*

**To detect the missing data**

---


Check by `isNull` value

```python
import pandas as pd
import numpy as np
```



```python
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
```

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

check for null value

```python
string_data.isnull()
```

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

The N/A handling method are provided in the data frame as given

![image-20230906053837943](./assets/image-20230906053837943.png)

### Filtering the data
---


The *NA* data can filtering out as shown

```python
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data
```

In [6]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

The `dropna` method will filter out the NA value

```python
data.dropna()
```

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

the data frame can be also filter

```python
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data
```

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

The `dropna` method will drop all the rows which contains NA value


```python
cleaned = data.dropna()
cleaned
```

In [9]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

**We** can drop only the line which contains **NA** all the rows usign `how='all'`

```python
data.dropna(how='all')
```

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

**To** drop only columns which contains  all NA, you can use the `axis=1 `parameter

In [11]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

```python
data.dropna(how='all',axis=1)
```

In [12]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

Try to add a new column with NA value
```python
data[4] = NA
data
```

In [13]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

drop na regarding to the axis
```python
data.dropna(axis=1, how='all')
```

Comparing to
```python
data.dropna(axis=1)
```

In [14]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

What are differents of `how='all'` and no `how` parameter

We can drop the rows which may have more data than the given value as we can tolerate for some data missing. `tresh` parameter is required here
```python
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df
```

In [16]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.031903       NaN       NaN
1  0.184846       NaN       NaN
2 -1.405612       NaN -0.353422
3  0.328592       NaN  2.632785
4  1.309716 -0.424679  1.171727
5 -0.551536  0.772030 -1.771562
6  0.963079 -0.726508  0.346958

drop all NA
```python
df.dropna()
```

In [18]:
df.dropna()

          0         1         2
4  1.309716 -0.424679  1.171727
5 -0.551536  0.772030 -1.771562
6  0.963079 -0.726508  0.346958

drop only a line which contains non-NA value more than or equal than the treshold
```python
df.dropna(thresh=2)
```

In [21]:
df.dropna(thresh=2)

          0         1         2
2 -1.405612       NaN -0.353422
3  0.328592       NaN  2.632785
4  1.309716 -0.424679  1.171727
5 -0.551536  0.772030 -1.771562
6  0.963079 -0.726508  0.346958

#### Work



Form the file given in `file/property_data.csv`

Provide the given output

In [37]:
df = pd.read_csv('file/property_data.csv')
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

In [38]:
df.dropna()

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0

output 1
![image-20230906061553156](./assets/image-20230906061553156.png)

In [39]:
df.dropna(thresh=6)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

Output 2

![image-20230906061619935](./assets/image-20230906061619935.png)

In [40]:
df.dropna(thresh=8,axis=1)

           PID     ST_NAME OWN_OCCUPIED NUM_BATH SQ_FT
0  100001000.0      PUTNAM            Y        1  1000
1  100002000.0   LEXINGTON            N      1.5    --
2  100003000.0   LEXINGTON            N        1   850
3  100004000.0    BERKELEY           12      NaN   700
4          NaN    BERKELEY            Y        2  1600
5  100006000.0    BERKELEY            Y        1   800
6  100007000.0  WASHINGTON          NaN   HURLEY   950
7  100008000.0     TREMONT            Y        1   NaN
8  100009000.0     TREMONT            Y        2  1800

Output 3

![image-20230906061652010](./assets/image-20230906061652010.png)

In [41]:
df.isna()

     PID  ST_NUM  ST_NAME  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT  PRICE
0  False   False    False         False         False     False  False  False
1  False   False    False         False         False     False  False   True
2  False    True    False         False          True     False  False   True
3  False   False    False         False         False      True  False   True
4   True   False    False         False         False     False  False   True
5  False   False    False         False          True     False  False   True
6  False    True    False          True         False     False  False   True
7  False   False    False         False         False     False   True   True
8  False   False    False         False         False     False  False   True

### Filling in missing data
---
Instead of filtering data. Default data may be used.
we can fil the default data for all `NA` values.

```python
df
```

In [42]:
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

```python
df.fillna(0)
```

In [43]:
df.fillna(0)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,0.0
2,100003000.0,0.0,LEXINGTON,N,0,1,850,0.0
3,100004000.0,201.0,BERKELEY,12,1,0,700,0.0
4,0.0,203.0,BERKELEY,Y,3,2,1600,0.0
5,100006000.0,207.0,BERKELEY,Y,0,1,800,0.0
6,100007000.0,0.0,WASHINGTON,0,2,HURLEY,950,0.0
7,100008000.0,213.0,TREMONT,Y,1,1,0,0.0
8,100009000.0,215.0,TREMONT,Y,na,2,1800,0.0

Or we can define the value for each column
```python
df.fillna({"PID":0.5,"ST_NUM":1.2})
```

In [44]:
df.fillna({"PID":0.5,"ST_NUM":1.2})

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,1.2,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,0.5,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,1.2,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

`fillna` returns a new object, but we can modify the existing object in-place
```python
df.fillna(0,inplace=True)
df
```

In [45]:
df.fillna(0,inplace=True)
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,0.0
2,100003000.0,0.0,LEXINGTON,N,0,1,850,0.0
3,100004000.0,201.0,BERKELEY,12,1,0,700,0.0
4,0.0,203.0,BERKELEY,Y,3,2,1600,0.0
5,100006000.0,207.0,BERKELEY,Y,0,1,800,0.0
6,100007000.0,0.0,WASHINGTON,0,2,HURLEY,950,0.0
7,100008000.0,213.0,TREMONT,Y,1,1,0,0.0
8,100009000.0,215.0,TREMONT,Y,na,2,1800,0.0

We can use the interpolation method to file the value.

Now we create a new data frame with some `NA`
```python
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
```

In [48]:
df = pd.DataFrame(np.random.rand(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0  0.031201  0.104314  0.646820
1  0.053905  0.420166  0.686869
2  0.184270       NaN  0.447609
3  0.336888       NaN  0.815420
4  0.864285       NaN       NaN
5  0.244867       NaN       NaN

Add the interpolation methods for more details google `dataframe fillna`
```python
df.ffill()
```

In [49]:
df.ffill()

          0         1         2
0  0.031201  0.104314  0.646820
1  0.053905  0.420166  0.686869
2  0.184270  0.420166  0.447609
3  0.336888  0.420166  0.815420
4  0.864285  0.420166  0.815420
5  0.244867  0.420166  0.815420

we can set limit of filling data that it should not be filled more than limit value.
```python
df.ffill(limit=2)
```

In [50]:
df.ffill(limit=2)

          0         1         2
0  0.031201  0.104314  0.646820
1  0.053905  0.420166  0.686869
2  0.184270  0.420166  0.447609
3  0.336888  0.420166  0.815420
4  0.864285       NaN  0.815420
5  0.244867       NaN  0.815420

Another fill method can be found in the api
such as `bfill` which is backward fill
```python
df.bfill()
```

In [51]:
df.bfill()

          0         1         2
0  0.031201  0.104314  0.646820
1  0.053905  0.420166  0.686869
2  0.184270       NaN  0.447609
3  0.336888       NaN  0.815420
4  0.864285       NaN       NaN
5  0.244867       NaN       NaN

Try

```python
df[6] = [1,2,3]
df
```

In [52]:
df[6] = [1,2,3]
df

ValueError: Length of values (3) does not match length of index (6)

#### Work

---
From the propery_data you have done from the last work
Provide this dataframe

In [53]:
df = pd.read_csv('file/property_data.csv')
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

In [54]:
df.fillna(-1)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,-1.0
2,100003000.0,-1.0,LEXINGTON,N,-1,1,850,-1.0
3,100004000.0,201.0,BERKELEY,12,1,-1,700,-1.0
4,-1.0,203.0,BERKELEY,Y,3,2,1600,-1.0
5,100006000.0,207.0,BERKELEY,Y,-1,1,800,-1.0
6,100007000.0,-1.0,WASHINGTON,-1,2,HURLEY,950,-1.0
7,100008000.0,213.0,TREMONT,Y,1,1,-1,-1.0
8,100009000.0,215.0,TREMONT,Y,na,2,1800,-1.0

Output 1
![image-20230906063035319](./assets/image-20230906063035319.png)

In [55]:
df.ffill()

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,20000.0
2,100003000.0,197.0,LEXINGTON,N,3,1,850,20000.0
3,100004000.0,201.0,BERKELEY,12,1,1,700,20000.0
4,100004000.0,203.0,BERKELEY,Y,3,2,1600,20000.0
5,100006000.0,207.0,BERKELEY,Y,3,1,800,20000.0
6,100007000.0,207.0,WASHINGTON,Y,2,HURLEY,950,20000.0
7,100008000.0,213.0,TREMONT,Y,1,1,950,20000.0
8,100009000.0,215.0,TREMONT,Y,na,2,1800,20000.0

Output 2
![image-20230906063122466](./assets/image-20230906063122466.png)

In [60]:
df['PID'].ffill(inplace=True)
df['ST_NUM'].ffill(inplace=True)
df['OWN_OCCUPIED'].fillna('N',inplace=True)
df['NUM_BEDROOMS'].fillna(0,inplace=True)
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,197.0,LEXINGTON,N,0,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,100004000.0,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,0,1,800,NaN
6,100007000.0,207.0,WASHINGTON,N,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

Output 3
![image-20230906063412850](./assets/image-20230906063412850.png)

## Data Transformation

We need to transform the data in the format which can manipulate it later.

### Removing Duplicates


Some data duplication must be removed to reduce the unusual behaviour of data
from the provided data

setting up a new dataframe
```python
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data
```

In [61]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The duplicated data is found by

```python
data.duplicated()
```

In [62]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

So we can drop the duplicate code
```python
data.drop_duplicates()
```

In [63]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

we can select key to check the duplicate data, adding a new column to the data frame to see which data is stored
```python
data['v1'] = range(7)
data
```

In [64]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

now check for duplicatoin
```python
data.duplicated()
```

In [66]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

check the dupplicate key only the key in column k1
```python
data.duplicated(['k1'])
```

In [67]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

The previous work keep the first data in the result data frame. We can keep the last entry of the duplicate data using the `keep` parameter
comparing these code?
```python
data.drop_duplicates(['k1','k2'])
```

In [70]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

with
```python
data.drop_duplicates(['k1','k2'],keep='last')
```

In [72]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or mapping

Data can be mapped to a better representation

with the provided data frame
```python
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data
```

In [74]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

The mapping dictionary is provided
```python
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
```

In [77]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

Then we can provide the map as given
```python
lowercased = data['food'].str.lower()
lowercased
```

In [75]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

then mapping the data
```python
data['animal'] = lowercased.map(meat_to_animal)
data
```

In [78]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing value
---

Some value can be replaced, in order to manage the code easier.
For example with the given data frame
```python
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data
```

In [79]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

The value -999 may be the **sentinel** values

The sentinel value is the value which define the state of data but not the real data. For example, the exit point or the `NA` of the value.
```python
data.replace(-999, np.nan)
```

In [81]:
import numpy as np
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

we can replace multiple data with only one value

```python
data.replace([-999,-1000],np.nan)
```

In [83]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

Or replace different value with different data
```python
data.replace([-999,-1000],[np.nan,0])
```

In [84]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

or using the dictionary to map the request data
```python
data.replace({-999: np.nan, -1000: 0})
```

In [85]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Index

The axis index which we loaded from the different sources may be hard to understand.
So we rename the index name for the better understanding
```python
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
```

In [86]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

We can use the function to change the name of each index
```python
transform = lambda x: x[:4].upper()
new_data_index = data.index.map(transform)
```

In [91]:
transform = lambda x: x[:4].upper()
new_data_index = data.index.map(transform)

To change the index name we have to set the index values
```python
data.index = new_data_index
data
```

In [92]:
data.index = new_data_index
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

Or if we want to rename it instancely (without seeing the new solution first)  we can use the `rename` method
```python
data.rename(index=str.title, columns=str.upper)
```

In [93]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

if we want to change the specific name, using the map for change the index name
```python
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})
```

In [94]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

To save the new name directly using `inplace` method
```python
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data
```

In [95]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

#### Work
---

From the previous work provide this output

Output1

fill PID, and PID as an index
![image-20230906065515528](./assets/image-20230906065515528.png)

In [99]:
df = pd.read_csv('file/property_data.csv')
df

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

In [104]:
df['PID'].interpolate(method ='linear', limit_direction ='forward',inplace=True)
df
# df.interpolate(method ='linear', limit_direction ='forward')

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,100005000.0,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

In [105]:
df.rename(columns={"PID":"à¸£à¸«à¸±à¸ªà¸šà¹‰à¸²à¸™","ST_NUM":"à¹€à¸¥à¸‚à¸—à¸µà¹ˆà¸šà¹‰à¸²à¸™","OWN_OCCUPIED":"à¹€à¸ˆà¹‰à¸²à¸‚à¸­à¸‡à¸šà¹‰à¸²à¸™","NUM_BEDROOMS":"à¸ˆà¸³à¸™à¸§à¸™à¸«à¹‰à¸­à¸‡à¸™à¸­à¸™","NUM_BATH":"à¸ˆà¸³à¸™à¸§à¸™à¸«à¹‰à¸­à¸‡à¸™à¹‰à¸³","SQ_FT":"à¸žà¸·à¹‰à¸™à¸—à¸µà¹ˆà¹ƒà¸Šà¹‰à¸ªà¸­à¸¢","PRICE":"à¸£à¸²à¸„à¸²à¸šà¹‰à¸²à¸™"})

,à¸£à¸«à¸±à¸ªà¸šà¹‰à¸²à¸™,à¹€à¸¥à¸‚à¸—à¸µà¹ˆà¸šà¹‰à¸²à¸™,ST_NAME,à¹€à¸ˆà¹‰à¸²à¸‚à¸­à¸‡à¸šà¹‰à¸²à¸™,à¸ˆà¸³à¸™à¸§à¸™à¸«à¹‰à¸­à¸‡à¸™à¸­à¸™,à¸ˆà¸³à¸™à¸§à¸™à¸«à¹‰à¸­à¸‡à¸™à¹‰à¸³,à¸žà¸·à¹‰à¸™à¸—à¸µà¹ˆà¹ƒà¸Šà¹‰à¸ªà¸­à¸¢,à¸£à¸²à¸„à¸²à¸šà¹‰à¸²à¸™
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,100005000.0,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

Output2
Change the column name to your language
![image-20230906065658172](./assets/image-20230906065658172.png)

### Discretization and Bining
---

Extract data and put it in the bins for analysis

The bin is the range of the data that we want to analyze
create a list as
```python
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
```

In [1]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Then we create a bin
```python
bins = [18, 25, 35, 60, 100]
```

In [2]:
bins = [18, 25, 35, 60, 100]

Then we cut the data in to a bin, the cuts represent the bins for each data
```python
cuts = pd.cut(ages, bins)
cuts
```

In [4]:
import pandas as pd
cuts = pd.cut(ages, bins)
cuts

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

Instead of using the texts we can see the code (index) of each bins
```python
cuts.codes
```

In [5]:
cuts.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

and the catagories, and the amount of value in each cuts can be shown
```python
cuts.categories
```

We can count the amount of value in each cuts by using `value_counts` method
```python
pd.value_counts(cuts)
```

In [6]:
pd.value_counts(cuts)

C:\Users\satie\AppData\Local\Temp\ipykernel_17980\1853263741.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cuts)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

We can set the name of each cuts by passing the arrays of labels
```python
group_names = ['Youth', 'YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)
```

In [7]:
group_names = ['Youth', 'YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

If we pass the integer number instead of the bin edge, it will compute the equal-length bins based on the minimum and maximum values.
```python
data = np.random.rand(20)
pd.cut(data,4,precision=2)
```

In [9]:
import numpy as np
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.0038, 0.25], (0.25, 0.5], (0.75, 0.99], (0.75, 0.99], (0.0038, 0.25], ..., (0.0038, 0.25], (0.75, 0.99], (0.0038, 0.25], (0.0038, 0.25], (0.25, 0.5]]
Length: 20
Categories (4, interval[float64, right]): [(0.0038, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

Try counting the value of data
```python
pd.value_counts(pd.cut(data,4,precision=2))
```

In [10]:
pd.value_counts(pd.cut(data,4,precision=2))

C:\Users\satie\AppData\Local\Temp\ipykernel_17980\3140619511.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(pd.cut(data,4,precision=2))

(0.0038, 0.25]    8
(0.75, 0.99]      8
(0.25, 0.5]       3
(0.5, 0.75]       1
Name: count, dtype: int64

### Detecting and Filtering Outliers
---


finding the outlining data and filter it out as it may be the error while gathering the data.
Let's start by having the given data
```python
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()
```

In [11]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.019765    -0.067756    -0.004318     0.009284
std       0.978439     1.009564     1.019799     0.946191
min      -4.110731    -3.347652    -3.703279    -2.876272
25%      -0.676827    -0.722974    -0.724232    -0.660939
50%      -0.018381    -0.125323    -0.013816     0.004617
75%       0.605916     0.665460     0.675390     0.604779
max       2.920428     2.960023     2.766785     2.985673

if we want to find the values in column 2 which the absolute value is exceeded 3
```python
col = data[2]
col[np.abs(col) >3]
```

In [12]:
col = data[2]
col[np.abs(col) >3]

158   -3.192708
682   -3.703279
Name: 2, dtype: float64

If we want to get rows which value is exceeding  3, we can use `any` methods
```python
data[(np.abs(data)>3).any(1)]
```

In [13]:
data[(np.abs(data)>3).any(1)]

TypeError: any() takes 1 positional argument but 2 were given

#### Work
---

From the given property file.
Categorize the size of the hourse as the small house (size is less than 800 sq,ft.),  the medium house (size is between 801-1200 sq.ft) and the large house ( size is more than 1200 sq.ft)

Show the number of each house size

You should ignore the value which is not the number value

In [16]:
import pandas as pd 

df = pd.read_csv('file/property_data.csv')
df.head()

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN

In [17]:
# Clean the 'SQ_FT' column by replacing non-numeric values with NaN, then drop those NaN values
df['SQ_FT'] = pd.to_numeric(df['SQ_FT'], errors='coerce')
property_data_clean = df.dropna(subset=['SQ_FT'])

# Define a function to categorize the house sizes
def categorize_house_size(sq_ft):
    if sq_ft < 800:
        return 'small'
    elif 800 <= sq_ft <= 1200:
        return 'medium'
    else: # sq_ft > 1200
        return 'large'

# Apply the function to the 'SQ_FT' column to create a new 'House_Size' column
property_data_clean['House_Size'] = property_data_clean['SQ_FT'].apply(categorize_house_size)

# Count the number of houses in each size category
house_size_counts = property_data_clean['House_Size'].value_counts()

house_size_counts

C:\Users\satie\AppData\Local\Temp\ipykernel_17980\75748706.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  property_data_clean['House_Size'] = property_data_clean['SQ_FT'].apply(categorize_house_size)

House_Size
medium    4
large     2
small     1
Name: count, dtype: int64

# Data Wrangling: Join, Combine, Reshape

## Hierachical Indexing
---


Allow index to have multiple index levels on an axis

Use when working with higher dimensional data ina lower dimensional form


à¹ŠUse this setup configuration

In [19]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

create multiple index as given
```python
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data
```

In [20]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

We can see the index of the data
```python
data.index
```

In [21]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

we can see data in the multi level index to see only some index
```python
data['b']
```

In [22]:
data['b']

1   -0.555730
3    1.965781
dtype: float64

We can see data from the inner level
```python
data['b':'c']
```

In [23]:
data['b':'C']

Series([], dtype: float64)

The `loc` method can be used to select data from a particular group of rows and columns in the hierachical index
```python
data.loc[['b','d']]
```

In [24]:
data.loc[['b','d']]

b  1   -0.555730
   3    1.965781
d  2    0.281746
   3    0.769023
dtype: float64

We can see data from the inner level
```python
data.loc[:,2]
```

In [25]:
data.loc[:,2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

The slide can be also used
```python
data.loc[:,2]
```

In [26]:
data.loc[:,2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

Hierachical indexing play important role in reshaping data and group-based oepration.

The Hierachical index can be rearragen as the DataFrame using `unstack` methods
```python
data.unstack()
```

In [27]:
data.unstack()

          1         2         3
a -0.204708  0.478943 -0.519439
b -0.555730       NaN  1.965781
c  1.393406  0.092908       NaN
d       NaN  0.281746  0.769023

and the inverse version is `stack`
```python
data.unstack().stack()
```

In [28]:
data.unstack().stack()

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

As the data frame,  axis can have hierachical index
```python
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame
```

In [29]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [44]:
frame = pd.DataFrame([[1,1,1],[2,2,2],[3,3,3],[4,4,4],[5,5,5],[6,6,6],[7,7,7]],
                     index=[['a', 'a', 'b', 'b','c','c','c'], [1, 2, 1, 2,1,2,3]],
                     columns=[['Green', 'Red', 'Green']])
frame

    Green Red Green
a 1     1   1     1
  2     2   2     2
b 1     3   3     3
  2     4   4     4
c 1     5   5     5
  2     6   6     6
  3     7   7     7

The Hierachy level can have names.
```python
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame
```

In [30]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### Work create this data frame

![image-20230907050812483](./assets/image-20230907050812483.png)

In [50]:
import pandas as pd
frame = pd.DataFrame([[4473.00,32113.00],[1597.0,28044.0],[5013.0,46028.0],[10236.0,30104.0],[15181.0,43097],[15063.0,44404.0],[13777.0,84133.0],[3730.0,13448.0],[8395.0,74449.0],[16054.0,58280.0]],
                     index=[['Chiang Mai', 'Chiang Mai', 'Chiang Mai', 'Chiang Mai','Lampang','Lampang','Lampang','Bangkok','Bangkok','Bangkok'], ['Muang','Sansai', 'MaeRim', 'Hangdong','Jeahom','Muang','Maetha','Pathumwan','Samsen','Don muang']],
                     columns=[['Income','population']])
frame

                       Income population
Chiang Mai Muang       4473.0    32113.0
           Sansai      1597.0    28044.0
           MaeRim      5013.0    46028.0
           Hangdong   10236.0    30104.0
Lampang    Jeahom     15181.0    43097.0
           Muang      15063.0    44404.0
           Maetha     13777.0    84133.0
Bangkok    Pathumwan   3730.0    13448.0
           Samsen      8395.0    74449.0
           Don muang  16054.0    58280.0

In [51]:
frame.index.names = ['Province', 'Subdistrict']
frame

                         Income population
Province   Subdistrict
Chiang Mai Muang         4473.0    32113.0
           Sansai        1597.0    28044.0
           MaeRim        5013.0    46028.0
           Hangdong     10236.0    30104.0
Lampang    Jeahom       15181.0    43097.0
           Muang        15063.0    44404.0
           Maetha       13777.0    84133.0
Bangkok    Pathumwan     3730.0    13448.0
           Samsen        8395.0    74449.0
           Don muang    16054.0    58280.0

## Reordering and Sorting Levels
---

To transform data, we may have to swap the level of the data frame

The `swaplevel` method can be used to swap the level
```python
frame.swaplevel('key1','key2')
```

In [55]:
frame.swaplevel('Province','Subdistrict')

                         Income population
Subdistrict Province
Muang       Chiang Mai   4473.0    32113.0
Sansai      Chiang Mai   1597.0    28044.0
MaeRim      Chiang Mai   5013.0    46028.0
Hangdong    Chiang Mai  10236.0    30104.0
Jeahom      Lampang     15181.0    43097.0
Muang       Lampang     15063.0    44404.0
Maetha      Lampang     13777.0    84133.0
Pathumwan   Bangkok      3730.0    13448.0
Samsen      Bangkok      8395.0    74449.0
Don muang   Bangkok     16054.0    58280.0

The index is not sort, so the multi hierachy is not set. we can sort the index at any level to set the better visualization
```python
frame.sort_index(level=1)
```

In [56]:
frame.sort_index(level=1)

                         Income population
Province   Subdistrict
Bangkok    Don muang    16054.0    58280.0
Chiang Mai Hangdong     10236.0    30104.0
Lampang    Jeahom       15181.0    43097.0
Chiang Mai MaeRim        5013.0    46028.0
Lampang    Maetha       13777.0    84133.0
Chiang Mai Muang         4473.0    32113.0
Lampang    Muang        15063.0    44404.0
Bangkok    Pathumwan     3730.0    13448.0
           Samsen        8395.0    74449.0
Chiang Mai Sansai        1597.0    28044.0

So swap the key and sort will make the hierarchy better
```python
frame.swaplevel(0,1).sort_index(level=0)
```

In [57]:
frame.swaplevel(0,1).sort_index(level=0)

                         Income population
Subdistrict Province
Don muang   Bangkok     16054.0    58280.0
Hangdong    Chiang Mai  10236.0    30104.0
Jeahom      Lampang     15181.0    43097.0
MaeRim      Chiang Mai   5013.0    46028.0
Maetha      Lampang     13777.0    84133.0
Muang       Chiang Mai   4473.0    32113.0
            Lampang     15063.0    44404.0
Pathumwan   Bangkok      3730.0    13448.0
Samsen      Bangkok      8395.0    74449.0
Sansai      Chiang Mai   1597.0    28044.0

The `sort_index` method can be used to sort the index
```python
frame.swaplevel(0,1).sort_index(level=0)
```

In [58]:
frame.swaplevel(0,1).sort_index(level=0)

                         Income population
Subdistrict Province
Don muang   Bangkok     16054.0    58280.0
Hangdong    Chiang Mai  10236.0    30104.0
Jeahom      Lampang     15181.0    43097.0
MaeRim      Chiang Mai   5013.0    46028.0
Maetha      Lampang     13777.0    84133.0
Muang       Chiang Mai   4473.0    32113.0
            Lampang     15063.0    44404.0
Pathumwan   Bangkok      3730.0    13448.0
Samsen      Bangkok      8395.0    74449.0
Sansai      Chiang Mai   1597.0    28044.0

## Summary Statistics by Level
---

The statistic data can be calculated with the specific level
For example, if we want to calculate on the rows data

We can calculate the sum of the data by the level
```python
frame.sum()
```

In [59]:
frame.sum()

Income         93519.0
population    454100.0
dtype: float64

then try
```python
frame.groupby(['key2']).sum()
```

In [60]:
frame.groupby(['Province']).sum()

             Income population
Province
Bangkok     28179.0   146177.0
Chiang Mai  21319.0   136289.0
Lampang     44021.0   171634.0

Or calculate on the column-wise
```python
frame.sum(axis=1)
```

In [61]:
frame.sum(axis=1)

Province    Subdistrict
Chiang Mai  Muang          36586.0
            Sansai         29641.0
            MaeRim         51041.0
            Hangdong       40340.0
Lampang     Jeahom         58278.0
            Muang          59467.0
            Maetha         97910.0
Bangkok     Pathumwan      17178.0
            Samsen         82844.0
            Don muang      74334.0
dtype: float64

then try
```python
frame.groupby(['color'],axis=1).sum()
```

In [66]:
frame.groupby(['color'],axis=1).sum()

C:\Users\satie\AppData\Local\Temp\ipykernel_17980\4037641996.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  frame.groupby(['color'],axis=1).sum()

KeyError: 'color'

## Indexing with DataFrame's Column


some time we want to use the row index as the columns
```python
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame
```

In [67]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

We can create a new data frame using some columns as index

```python
frame2 = frame.set_index(['c','d'])
frame2
```

In [68]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

By default, the column is removed from the source data frame. However, if we do not want to remove the column, the `drop` parameter is passed
```python
frame.set_index(['c','d'],drop = False)
```

In [69]:
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

### Work



From the given [./file/car_details.xlsx](./file/car_details.xlsx)

provided the hierarchy data frame which carbrand, carmodel, and the model_name TH is a key indexes

All

Then try to find the average standard price for  each car brand, ignore the `NA` value

In [71]:
import pandas as pd
data = pd.read_excel('file/cardetails.xlsx')
data

,Table 1,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,serialNo,car_brand,car_model,model_name_th,nickname,item_name,fitment_detail,standard_price
1,IC-0000001,AUDI,Q5,à¸„à¸´à¸§5,à¹‚à¸‰à¸¡à¸›à¸µ 2008-2016,à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡,-,NaN
2,IC-0000002,BMW,SERIES 5,à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5,à¹‚à¸‰à¸¡à¸›à¸µ 2003-2010 (E60),à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡,-,NaN
3,IC-0000003,BMW,SERIES 5,à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5,à¹‚à¸‰à¸¡à¸›à¸µ 2010-2017 (F10),à¹„à¸ªà¹‰à¸à¸£à¸­à¸‡à¸™à¹‰à¸³à¸¡à¸±à¸™à¹€à¸„à¸£à¸·à¹ˆà¸­à¸‡,-,NaN
4,JA-0000001,BMW,SERIES 5,à¸‹à¸µà¸£à¸µà¹ˆà¸¢à¹Œ5,à¹‚à¸‰à¸¡à¸›à¸µ 2010-2017 (F10),à¹ƒà¸šà¸›à¸±à¸”à¸™à¹‰à¸³à¸à¸™,-,NaN
...,...,...,...,...,...,...,...,...
4725,NaN,TOYOTA,HILUX VIGO,à¹„à¸®à¸¥à¸±à¸à¸‹à¹Œ à¸§à¸µà¹‚à¸à¹‰,à¹‚à¸‰à¸¡à¸›à¸µ 2003-2016 (Vigo 2WD),à¹‚à¸Šà¹‰à¸„à¸­à¸±à¸ž,à¸«à¸™à¹‰à¸²,1250
4726,NaN,TOYOTA,HILUX VIGO,à¹„à¸®à¸¥à¸±à¸à¸‹à¹Œ à¸§à¸µà¹‚à¸à¹‰,à¹‚à¸‰à¸¡à¸›à¸µ 2003-2016 (Vigo 2WD),à¹‚à¸Šà¹‰à¸„à¸­à¸±à¸ž,à¸«à¸™à¹‰à¸²,1250
4727,NaN,TOYOTA,COROLLA ALTIS,à¹‚à¸„à¹‚à¸£à¸¥à¹ˆà¸² à¸­à¸±à¸¥à¸•à¸´à¸ª,à¹‚à¸‰à¸¡à¸›à¸µ 2008-2012 (ZZE141),à¹‚à¸Šà¹‰à¸„à¸­à¸±à¸ž,à¸«à¸¥à¸±à¸‡,1440
4728,NaN,TOYOTA,HILUX REVO,à¹„à¸®à¸¥à¸±à¸à¸‹à¹Œ à¸£à¸µà¹‚à¸§à¹ˆ,à¹‚à¸‰à¸¡à¸›à¸µ 2016-2018 (Revo 4WD à¹à¸¥à¸° Pre-Runner à¸¢à¸à¸ªà¸¹à¸‡),à¹‚à¸Šà¹‰à¸„à¸­à¸±à¸ž,à¸«à¸™à¹‰à¸²,1580
4729,NaN,TOYOTA,FORTUNER,à¸Ÿà¸­à¸£à¹Œà¸ˆà¸¹à¸™à¹€à¸™à¸­à¸£à¹Œ,à¹‚à¸‰à¸¡à¸›à¸µ 2015-2019 (KUN160),à¹‚à¸Šà¹‰à¸„à¸­à¸±à¸ž,à¸«à¸™à¹‰à¸²,1580

In [72]:
# Define the correct header and skip rows that do not contain the actual data
header = data.iloc[0]
data.columns = header
data = data[1:]

# Now, let's clean the data
# Convert standard_price to numeric, forcing errors to NaN (ignoring non-numeric values)
data['standard_price'] = pd.to_numeric(data['standard_price'], errors='coerce')

# Drop rows with NaN values in the 'standard_price' column
clean_data = data.dropna(subset=['standard_price'])

# Group by 'car_brand' and calculate the mean of 'standard_price'
average_prices = clean_data.groupby('car_brand')['standard_price'].mean().reset_index()

average_prices

C:\Users\satie\AppData\Local\Temp\ipykernel_17980\1914065518.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['standard_price'] = pd.to_numeric(data['standard_price'], errors='coerce')

        car_brand  standard_price
0             BMW     1400.000000
1       CHEVROLET      912.181208
2            FORD      829.821429
3           HONDA      852.875000
4         HYUNDAI      661.538462
5           ISUZU      659.400778
6           LEXUS      783.333333
7           MAZDA      872.175141
8   MERCEDES-BENZ     1529.166667
9      MITSUBISHI      588.575499
10         NISSAN      684.016787
11         PROTON     1050.000000
12         SUBARU     1525.000000
13         SUZUKI      684.418605
14         TOYOTA      827.225443
15     VOLKSWAGEN     1436.666667